
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.Покупки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.Покупки.Добавить();
		Движение.Период = Дата;
		Движение.Пользователь = Пользователь;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.ТипНоменклатуры = ТекСтрокаТовары.Номенклатура.ТипНоменклатуры;
		Движение.Контрагент = Контрагент;
		Движение.Количество = ТекСтрокаТовары.Количество;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
	КонецЦикла;

КонецПроцедуры
