
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ТекПользователь = Константы.ТекущийПользователь.Получить();
		Если ТекПользователь <> Справочники.Пользователи.ПустаяСсылка() Тогда
			Объект.Пользователь = ТекПользователь;
		КонецЕсли;   
		Объект.Дата = ТекущаяДата();
		Объект.Контрагент = Справочники.Контрагенты.НайтиПоНаименованию("Мария-Ра");
		НСтрока = Объект.Товары.Добавить();
		НСтрока.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию("Продукты");
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество  * Элементы.Товары.ТекущиеДанные.Цена;
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	Элементы.Товары.ТекущиеДанные.Сумма = Элементы.Товары.ТекущиеДанные.Количество  * Элементы.Товары.ТекущиеДанные.Цена;
КонецПроцедуры

